[
  {
    "english": "obstacle",
    "indonesia": "hambatan",
    "definisi": "sesuatu yang menghalangi atau menghambat kemajuan atau pencapaian",
    "sentence": "Mereka berhasil mengatasi semua hambatan dalam proyek tersebut."
  },
  {
    "english": "organization",
    "indonesia": "organisasi",
    "definisi": "kelompok orang yang bekerja bersama untuk mencapai tujuan tertentu",
    "sentence": "Organisasi ini memiliki struktur manajemen yang kuat."
  },
  {
    "english": "outcome",
    "indonesia": "hasil",
    "definisi": "apa yang terjadi atau diproduksi sebagai hasil dari suatu kejadian atau tindakan",
    "sentence": "Hasil dari uji coba tersebut akan diumumkan besok."
  },
  {
    "english": "participation",
    "indonesia": "partisipasi",
    "definisi": "aksi mengambil bagian dalam suatu kegiatan atau acara",
    "sentence": "Partisipasinya dalam proyek tersebut sangat berarti."
  },
  {
    "english": "perspective",
    "indonesia": "perspektif",
    "definisi": "cara seseorang melihat atau memahami sesuatu",
    "sentence": "Perspektifnya tentang masalah ini sangat berbeda dari yang lain."
  },
  {
    "english": "policy",
    "indonesia": "kebijakan",
    "definisi": "aturan atau rencana resmi yang digunakan oleh pemerintah atau organisasi",
    "sentence": "Kebijakan baru tentang lingkungan sedang dipertimbangkan."
  },
  {
    "english": "preference",
    "indonesia": "preferensi",
    "definisi": "pilihan atau keinginan yang lebih disukai dari opsi lain",
    "sentence": "Preferensinya adalah bekerja di lingkungan yang dinamis."
  },
  {
    "english": "priority",
    "indonesia": "prioritas",
    "definisi": "hal yang dianggap lebih penting atau mendesak untuk diperhatikan atau dilakukan",
    "sentence": "Pendidikan anak-anak adalah prioritas utama bagi banyak orang tua."
  },
  {
    "english": "procedure",
    "indonesia": "prosedur",
    "definisi": "langkah-langkah yang harus diikuti dalam melakukan suatu tugas atau memecahkan suatu masalah",
    "sentence": "Prosedur pengujian perangkat lunak harus dilakukan secara hati-hati."
  },
  {
    "english": "promotion",
    "indonesia": "promosi",
    "definisi": "aksi meningkatkan atau memajukan sesuatu, terutama dalam pekerjaan atau karier",
    "sentence": "Dia mendapatkan promosi setelah bekerja keras selama lima tahun."
  }
]